app/controllers/goods_controller.rb

  def index
    @goods_count = Good.count
    @goods = Good.all.order(:code)
---
SELECT "goods".* FROM "goods"  ORDER BY "goods"."code" ASC