app/controllers/goods_controller.rb

SELECT COUNT(*) FROM "goods"
SELECT "goods".* FROM "goods"
---
  def index
    @goods_count = Good.count
    @goods = Good.all

SELECT  "goods".* FROM "goods" WHERE "goods"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @good = Good.find(params[:id])

INSERT INTO "goods" ("code", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["code", 3], ["name", "Ford Mustang"], ["created_at", "2015-08-23 17:19:06.411218"], ["updated_at", "2015-08-23 17:19:06.411218"]]
---
  def create
    @good = Good.new
    @good.code = params[:good][:code]
    @good.name = params[:good][:name]
    @good.save

SELECT  "goods".* FROM "goods" WHERE "goods"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @good = Good.find(params[:id])

SELECT  "goods".* FROM "goods" WHERE "goods"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "goods" SET "code" = $1, "updated_at" = $2 WHERE "goods"."id" = $3  [["code", 1], ["updated_at", "2015-08-23 17:30:23.161102"], ["id", 1]]
---
  def update
    @good = Good.find(params[:id])
    @good.code = params[:good][:code]
    @good.name = params[:good][:name]
    @good.save

DELETE FROM "goods" WHERE "goods"."id" = $1  [["id", 3]]
SELECT  "goods".* FROM "goods" WHERE "goods"."id" = $1 LIMIT 1  [["id", 3]]
---
  def destroy
    Good.find(params[:id]).destroy